Autodesk.Revit.DB.DirectContext3D.Camera.Transform(Autodesk.Revit.DB.Transform)
Transforms the camera
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.UpDirection
Up direction of the camera
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.ViewDirection
Direction that the camera is facing
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.EyePosition
Camera's position in the world
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.#ctor(Autodesk.Revit.DB.DirectContext3D.Camera)
Camera
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017